# 1
 * Программа: Первая программа с переменными
 * Описание: Демонстрация объявления переменных разных типов,
 *           присваивания значений и вывода на экран
 * 
 * Задание: Создать программу, которая объявляет переменные int a, 
 *          float b, char c, присваивает им значения и выводит их на экран
 * 
 * Ожидаемый вывод:
 * a = 10
 * b = 3.14
 * c = A
 * 
 * Используемые технологии:
 * - Язык C (стандарт C99/C11)
 * - Библиотека stdio.h для ввода/вывода
 * - Компилятор GCC (или любой другой компилятор Си)
 * 
 * Инструкция по запуску:
 * 1. Сохранить файл как program.c
 * 2. Компиляция: gcc program.c -o program
 * 3. Запуск: ./program (Linux/macOS) или program.exe (Windows)
 * 4. Или использовать онлайн-компилятор (onlinegdb.com, replit.com)
 # 2
 * Программа: Размеры типов данных в Си
 * Описание: Программа выводит размеры (в байтах) основных типов данных 
 *           в языке программирования Си с использованием оператора sizeof
 * 
 * Задание: Напишите программу, которая выводит размеры типов char, int, 
 *          float, double с использованием оператора sizeof
 * 
 * Пример вывода (на большинстве систем):
 * char: 1
 * int: 4
 * float: 4
 * double: 8
 * 
 * Примечание: Размеры могут незначительно отличаться в зависимости от:
 *             - архитектуры процессора (32-битная / 64-битная)
 *             - операционной системы
 *             - компилятора и его настроек
 * 
 * Используемые технологии:
 * - Язык программирования: C (стандарт C99/C11)
 * - Библиотека: stdio.h (для ввода/вывода)
 * - Оператор: sizeof (для определения размера типов)
 * - Компилятор: GCC / MinGW / Clang / любой другой компилятор Си
 * 
 * Инструкция по запуску:
 * 1. Сохранить файл как sizes.c
 * 2. Компиляция: gcc sizes.c -o sizes
 * 3. Запуск: 
 *    - Linux/macOS: ./sizes
 *    - Windows: sizes.exe
 * 4. Или использовать онлайн-компилятор (onlinegdb.com, replit.com)
 # 3
 * Программа: Переменные и память (значения и адреса)
 * Описание: Программа демонстрирует связь переменных с оперативной памятью:
 *           - Объявление и инициализация переменных разных типов
 *           - Вывод значений переменных
 *           - Вывод адресов, по которым эти значения хранятся в памяти
 * 
 * Задание: Создать переменные int a, float b, char c и вывести их значения 
 *          и адреса в памяти.
 * 
 * Пример вывода (адреса будут отличаться на каждом компьютере):
 * a = 10, address = 0x7ffd3a8e4a1c
 * b = 3.14, address = 0x7ffd3a8e4a20
 * c = A, address = 0x7ffd3a8e4a24
 * 
 * Важно: Адреса каждый раз могут быть разными при запуске программы!
 * 
 * Используемые технологии:
 * - Язык программирования: C (стандарт C99/C11)
 * - Библиотека: stdio.h (для ввода/вывода)
 * - Оператор: & (амперсанд) - оператор взятия адреса
 * - Спецификатор: %p - для вывода указателей (адресов)
 * - Компилятор: GCC / MinGW / Clang / любой другой компилятор Си
 * 
 * Инструкция по запуску:
 * 1. Сохранить файл как memory.c
 * 2. Компиляция: gcc memory.c -o memory
 * 3. Запуск: 
 *    - Linux/macOS: ./memory
 *    - Windows: memory.exe
 * 4. Или использовать онлайн-компилятор (onlinegdb.com, replit.com)
 # 4 
 * Программа: Оператор остатка от деления (деление по модулю)
 * Описание: Программа демонстрирует работу оператора % (остаток от деления)
 *           Пользователь вводит два целых числа, программа вычисляет и выводит
 *           остаток от деления первого числа на второе
 * 
 * Задание: Написать программу, которая запрашивает у пользователя два целых числа
 *          и выводит результат операции a % b (остаток от деления)
 * 
 * Пример работы программы:
 * Введите первое число: 10
 * Введите второе число: 3
 * 10 % 3 = 1
 * 
 * Объяснение: 10 / 3 = 3 (целая часть) и 1 в остатке, поэтому 10 % 3 = 1
 * 
 * Используемые технологии:
 * - Язык программирования: C (стандарт C99/C11)
 * - Библиотека: stdio.h (для ввода/вывода)
 * - Оператор: % (остаток от деления / modulo)
 * - Функции: printf() (вывод), scanf() (ввод)
 * - Компилятор: GCC / MinGW / Clang / любой другой компилятор Си
 * 
 * Инструкция по запуску:
 * 1. Сохранить файл как remainder.c
 * 2. Компиляция: gcc remainder.c -o remainder
 * 3. Запуск: 
 *    - Linux/macOS: ./remainder
 *    - Windows: remainder.exe
 * 4. Или использовать онлайн-компилятор (onlinegdb.com, replit.com)
 */

